# In exercise folder (same level as this notebook on github) there is hiring.csv. This file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates,

2 yr experience, 9 test score, 6 interview score

12 yr experience, 10 test score, 10 interview score

In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model

In [12]:
!pip install word2number

Requirement already satisfied: word2number in c:\programdata\anaconda3\lib\site-packages (1.1)

In [13]:
from word2number import w2n

In [14]:
df=pd.read_csv(r"https://raw.githubusercontent.com/codebasics/py/master/ML/2_linear_reg_multivariate/Exercise/hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [15]:
df.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   experience                  6 non-null      object
 1   test_score(out of 10)       7 non-null      float64
 2   interview_score(out of 10)  8 non-null      int64
 3   salary($)                   8 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 384.0+ bytes

In [17]:
df['experience']=df['experience'].fillna('zero')
df['experience']

0      zero
1      zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [18]:
df.isnull().sum()

experience                    0
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [19]:
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [20]:
import math
median_test_score = math.floor(df['test_score(out of 10)'].mean())
median_test_score

7

In [21]:
df['test_score(out of 10)']=df['test_score(out of 10)'].fillna(median_test_score)

In [22]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [23]:
reg=linear_model.LinearRegression()
reg.fit(df.drop('salary($)',axis=1),df['salary($)'])

LinearRegression()

In [24]:
reg.predict([[12,10,10]])

array([93747.79628651])

In [25]:
reg.coef_

array([2922.26901502, 2221.30909959, 2147.48256637])

In [26]:
reg.intercept_

14992.65144669314

In [28]:
#predict more values
import pandas as pd
x=([[12,10,10],[21,8,10],[11,7,5]])
x1=pd.DataFrame(x)
y=reg.predict(x1)
y=pd.DataFrame(y)
df=pd.concat([x1,y],axis=1,keys=['resume','Salary'])
df

  resume                 Salary
       0   1   2              0
0     12  10  10   93747.796287
1     21   8  10  115605.599223
2     11   7   5   73424.187141